# -*- coding: utf-8 -*-
# 本课程目的
# Python基础使用
# Python的基础语法
# Python的常用数据类型
# Python的常用数据类型-数字、字符串
# 第三方库安装
# 1； pycharm在线安装
# 2 ： pip在线安装 cmd -- pip install requests
# 3: python离线安装 1 解压  在当前文件夹执行python setyp.py install
# print("hello w orld")

# Python 基础语法
# 标识符由字母、数字、下划线组成。见名知义。不能以数字开头
# 标识符区分大小写的：函数、类名、变量名、模块名、项目名
# 必须赋值后才可以引用
# 不能使用Python关键字命名

# 行和缩减  四个空格 不能tab和空格混用

# 多好语句使用斜杠（\）将一行的语句分为多行显示
# 引号 可以使用单引号、双引号、三引号来表示字符串，引号的开始与结束必须的相同类型。
# 其中三引号可以有多行组成

# Python注释 # 单行注释  """ 多行注释可以使用三引号表示
# Python输出 print() 默认是换行的。不同的数据之间用逗号隔开
# input() 输入： input从控制台里面获取一个数据，获取到的类型是字符串类型
# print('''
# # 刘家海
# # 多行注释
# # 多行注释
# # # ''')
# print('单引号')
# print("双引号")

"""
多行注释
多行注释表示
"""
# 单引号互斥 用\转义 变成普通的字符 不是字符串的双引号或单引号
# print(input('请输入贵姓： '))

# 变量: 给某个标识符赋值 才能叫做变量 必须要要赋值 才有意义
# x=1
# y=x+4
# x='abc'
# x=True
# x=False
# x=5.6
# x=[]
# x=()
# x={}
# x=set()
#python常见的数据类型
# 数字：整数 浮点型
# 布尔类型： boolean True False
# 字符串： str  '' "" """""" ''''''
# 元组 列表 字典 集合

